app/Http/Controllers/CityController.php

select * from `cities` where `cities`.`deleted_at` is null order by `id` desc limit 10 offset 0
select count(*) as aggregate from `cities` where `cities`.`deleted_at` is null
---
    public function index()
    {
        $cities = City::orderByDesc('id')->paginate(10);

insert into `cities` (`name`, `slug`, `updated_at`, `created_at`) values ('Ciamis', 'ciamis', '2024-09-03 14:08:41', '2024-09-03 14:08:41')
---
    public function store(StoreCityRequest $request)
    {
        /**
        * 1 validasi data
        * 2 mulai insert data ke table database
        * 3 mengembalikan pengguna kepada halaman index  (list of city)
        */

        DB::transaction(function() use ($request){
            $validated = $request->validated();
            $validated['slug'] = Str::slug($validated['name']);
            $NewData = City::Create($validated);