app/Http/Controllers/CountryController.php

    public function index()
    {
        $countries = Country::orderByDesc('id')->paginate(10);
---
select * from `countries` where `countries`.`deleted_at` is null order by `id` desc limit 10 offset 0
select count(*) as aggregate from `countries` where `countries`.`deleted_at` is null