app/Http/Controllers/HotelBookingController.php

select count(*) as aggregate from `hotel_bookings` where `hotel_bookings`.`deleted_at` is null
---
    public function index()
    {
        $hotel_bookings = HotelBooking::with(['hotel','customer'])->orderByDesc('id')->paginate(10);