app/Http/Controllers/HotelController.php

    public function index()
    {
        $hotels = Hotel::with(['rooms'])->orderByDesc('id')->paginate(10);
---
select * from `hotels` where `hotels`.`deleted_at` is null order by `id` desc limit 10 offset 0
select count(*) as aggregate from `hotels` where `hotels`.`deleted_at` is null

    public function create()
    {
        $countries = Country::orderByDesc('id')->get();
        $cities = City::orderByDesc('id')->get();
---
select * from `countries` where `countries`.`deleted_at` is null order by `id` desc
select * from `cities` where `cities`.`deleted_at` is null order by `id` desc

    public function store(StoreHotelRequest $request)
    {
        //Log::info('akses store');
        DB::transaction(function() use ($request){
            $validated = $request->validated();

            if($request->hasFile('thumbnail')){
                $thumbnailPath =
                $request->file('thumbnail')->store('thumbnails/' . date('Y/m/d') , 'public');
                $validated['thumbnail'] = $thumbnailPath;
            }

            $validated['slug'] = Str::slug($validated['name']);
            $hotel = Hotel::Create($validated);

            // menyimpan beberapa photo
            if($request->hasFile('photos')){
                foreach($request->file('photos') as $photo){
                    $photoPath = $photo->store('photos/' . date('Y/m/d'), 'public');

                    // akses relasi
                    $hotel->photos()->create([
                        'photo' => $photoPath
                    ]);
---
insert into `hotels` (`name`, `link_gmaps`, `address`, `thumbnail`, `city_id`, `country_id`, `star_level`, `slug`, `updated_at`, `created_at`) values ('Mason Pine Hotel', 'test', 'test', 'thumbnails/2024/09/03/GqQVi7FJQ3YEkJ5JVnJjIqBH57nzE3iBHFQKJixN.jpg', '297', '137', '5', 'mason-pine-hotel', '2024-09-03 12:42:21', '2024-09-03 12:42:21')
insert into `hotel_photos` (`photo`, `hotel_id`, `updated_at`, `created_at`) values ('photos/2024/09/03/7No8LiLPkX4wmSSFsVPj9gO22E4FcNWWd88fcTcH.jpg', 1, '2024-09-03 12:42:21', '2024-09-03 12:42:21')